backend/controllers/SurveysController.php

    public function actionIndex() {
        $searchModel = new SurveySearch();
        $dataProvider = $searchModel->search(Yii::$app->request->queryParams);
        $surveyz = new Surveys();
        $surv = $surveyz->find()->orderBy(['survey_id' => SORT_ASC])->all();
---
SELECT * FROM `surveys` ORDER BY `survey_id`

    public function actionCreate() {
        $model = new Surveys();

        if ($model->load(Yii::$app->request->post())) {
            if ($model->validate() == TRUE) {
                // print_r($model);
                $model->save();
---
INSERT INTO `surveys` (`title`, `start_at`, `end_at`, `language_id`, `client_id`, `country_id`, `status_id`) VALUES ('Gigi Motors2', '2016-11-16 07:45:59', '2016-11-09 02:50:59', 2, 7, 3, 0)

    public function actionCqns($sid, $id) { {
            $model = $this->Gtqns($id);
            $responses = new \backend\models\Responses();
            $rmodel = $responses->find()->where(['xls_id' => $id])->orderBy(['id' => SORT_DESC])->all();
---
SELECT * FROM `responses` WHERE `xls_id`='29' ORDER BY `id` DESC

    protected function findModel($id) {
        if (($model = Surveys::findOne($id)) !== null) {
---
SELECT * FROM `surveys` WHERE `survey_id`='28'