backend/views/surveys/_form.php


    <?=
    //language
    $form->field($model, 'language_id')->widget(Select2::classname(), [
        'data' => ArrayHelper::map(Languages::find()->all(), 'language_id', 'language'),
        'language' => 'de',
        'options' => ['placeholder' => 'Select the desired the poll language ...'],
        'pluginOptions' => [
            'allowClear' => true
        ],
    ]);
---
SELECT * FROM `languages`




    <?=
    $form->field($model, 'client_id')->widget(Select2::classname(), [
        'data' => ArrayHelper::map(Clients::find()->all(), 'client_id', 'clientName'),
        'language' => 'de',
        'options' => ['placeholder' => 'Select the desired Client ...'],
        'pluginOptions' => [
            'allowClear' => true
        ],
    ]);
    ?>


    <?=
    $form->field($model, 'country_id')->widget(Select2::classname(), [
        'data' => ArrayHelper::map(Countries::find()->all(), 'country_id', 'name'),
        'language' => 'de',
        'options' => ['placeholder' => 'Select the Country the poll will run in.'],
        'pluginOptions' => [
            'allowClear' => true
        ],
    ]);
---
SELECT * FROM `clients`
SELECT * FROM `countries`