backend/views/surveys/index.php

SELECT * FROM `countries` WHERE `country_id`=3
---
                            <td style="display:none;"><?= $dp->survey_id; ?></td>
                            <td><?= $dp->title; ?></td>
                            <td><?= $dp->clientClients->clientName; ?> </td>
                            <td><?= $dp->countryCountries->name; ?> </td>